## DataFrame
- index, column, value

### create

In [1]:
#1 column first
df = pd.DataFrame(columns=["Name", "Salary"])

df["Name"] = ["Josep", "Yaan"]
df["Debt"] = [200, 300]
df

    Name Salary  Debt
0  Josep    NaN   200
1   Yaan    NaN   300

In [2]:
#2 Dic type
name = ["Josep", "Yaan"]
debt = [200, 300]
df = pd.DataFrame({"Name":name, "Debt":debt})
df

   Debt   Name
0   200  Josep
1   300   Yaan

In [3]:
#2 - 2 Dic type
name = ["Josep", "Yaan"]
debt = [200, 300]
dic = {"Name":name, "Debt":debt}

df = pd.DataFrame(dic)
df

   Debt   Name
0   200  Josep
1   300   Yaan

In [4]:
#3 with own index
index = ["1st", "2nd"]
name = ["Josep", "Yaan"]
debt = [200, 300]
dic = {"Name":name, "Debt":debt}

df = pd.DataFrame(dic, index = index)
df

     Debt   Name
1st   200  Josep
2nd   300   Yaan

### Insert
- column insert

In [5]:
df["Salary"] = "" #broadcasting
print(df)

df["Salary"] = [20, 30]
df

     Debt   Name Salary
1st   200  Josep
2nd   300   Yaan

     Debt   Name  Salary
1st   200  Josep      20
2nd   300   Yaan      30

#### apply

In [6]:
df["M_interest"] = df['Debt'].apply(lambda x: round(x*0.05, 2))
df  #- apply: similar with map

     Debt   Name  Salary  M_interest
1st   200  Josep      20        10.0
2nd   300   Yaan      30        15.0

- row insert

In [10]:
# 가장 마지막에 자동으로 데이터 넣기
# df.loc[ ] = { " ": " ", -------}  #basic
df.loc[len(df)] = {"Name":"Kre", "Salary":25, "Debt": 0, "M_interest":0}
df

     Debt   Name  Salary  M_interest
1st   200  Josep      20        10.0
2nd   300   Yaan      30        15.0
2       0    Kre      25         0.0
3       0    Kre      25         0.0

### reset index

In [12]:
df.reset_index(drop=True, inplace=True)
df

   Debt   Name  Salary  M_interest
0   200  Josep      20        10.0
1   300   Yaan      30        15.0
2     0    Kre      25         0.0
3     0    Kre      25         0.0